In [1]:
import numpy as np
import pandas as pd
import json

In [2]:
# Load dataset & extract features from TLEs

with open("satellite_data_new.json", "r") as f:
    raw = json.load(f)

In [3]:
df = pd.DataFrame(raw)
df

,OBJECT_NAME,NORAD_CAT_ID,INTLDES,COUNTRY,LAUNCH_DATE,TLE_DATA
0,EXPLORER 1,4,1958-001A,US,1958-02-01,"{'TLE_OBJECT_NAME': 'EXPLORER 1', 'TLE_LINE1':..."
1,VANGUARD 1,5,1958-002B,US,1958-03-17,"{'TLE_OBJECT_NAME': 'VANGUARD 1', 'TLE_LINE1':..."
2,EXPLORER 3,6,1958-003A,US,1958-03-26,None
3,EXPLORER 4,9,1958-005A,US,1958-07-26,"{'TLE_OBJECT_NAME': 'EXPLORER 4', 'TLE_LINE1':..."
4,SCORE,10,1958-006A,US,1958-12-18,None
...,...,...,...,...,...,...
33681,OBJECT E,65263,2025-180E,PRC,2025-08-19,None
33682,ZK-1A R/B,65264,2025-180F,PRC,2025-08-19,None
33683,USA 555,65271,2025-183A,US,2025-08-22,None
33684,LIMASAT,65272,2025-183B,US,2025-08-22,None
33685,DRAGON CRS-33,65304,2025-186A,US,2025-08-24,None

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 33686 entries, 0 to 33685
Data columns (total 6 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   OBJECT_NAME   33686 non-null  object
 1   NORAD_CAT_ID  33686 non-null  object
 2   INTLDES       33686 non-null  object
 3   COUNTRY       33686 non-null  object
 4   LAUNCH_DATE   33686 non-null  object
 5   TLE_DATA      23663 non-null  object
dtypes: object(6)
memory usage: 1.5+ MB

In [5]:
df["COUNTRY"].value_counts()

COUNTRY
US     24932
PRC     8648
CA       106
Name: count, dtype: int64

In [6]:
df.isnull().sum()

OBJECT_NAME         0
NORAD_CAT_ID        0
INTLDES             0
COUNTRY             0
LAUNCH_DATE         0
TLE_DATA        10023
dtype: int64